<template><div><h3 id="ads的定位是干什么的-有什么能力" tabindex="-1"><a class="header-anchor" href="#ads的定位是干什么的-有什么能力"><span>ads的定位是干什么的，有什么能力</span></a></h3>
<p>1、ads全名叫赞同外设服务，用于提供一套服务化的调用标准与调用方式，使应用于外设解耦。（ads是一个桥梁，承接应用于外设厂商驱动）
2、ads对应用层提供一套统一的调用接口，屏蔽底层厂商差异，应用只需要关心业务逻辑，而不需要关系外设的厂商。
3、ads对外设厂商提供一套接口标准，接口标准由项目组统一按照业务对某个类型的外设需求与外设基础功能定制，外设厂商只需按接口标准提供驱动封装，即可集成到ads中，为系统提供服务</p>
<h3 id="有什么好处" tabindex="-1"><a class="header-anchor" href="#有什么好处"><span>有什么好处</span></a></h3>
<p>1、助力行内形成<strong>统一的外设调用标准</strong>，其他系统建设，也可参考此标准执行，解决外设驱动管理混乱问题
2、<strong>独立进程</strong>方式，已服务化方式调用，解决<strong>外设崩溃导致应用崩溃问题</strong>
3、<strong>屏蔽底层外设厂商差异</strong>，不同的外设厂商，只需要按同样标准进行实现，对接ads即可。应用建设时，只需要关心业务逻辑，不需要关心外设实现
4、后续新的<strong>外设厂商</strong>增加，只需要按同样标注实现，应用无需改造。有新的外设类型增加，只需要增加对应类型标准，然后实现即可
5、应用在<strong>信创</strong>适配改造时，只需要让外设厂商按同样标准提供信创驱动，即可集成调用，应用无需修改</p>
<h3 id="标准怎么制定与遵循" tabindex="-1"><a class="header-anchor" href="#标准怎么制定与遵循"><span>标准怎么制定与遵循</span></a></h3>
<p>赞同可以提供他行参考的接口标准，各个项目组根据业务需求与外设能力自行定义。一定要引导行方以他们的角度去建设标准，应用与厂商进行适配，在这个过程中我们提供标准的基础版本以及需要的其他材料</p>
<h3 id="对于老旧外设如何处理" tabindex="-1"><a class="header-anchor" href="#对于老旧外设如何处理"><span>对于老旧外设如何处理</span></a></h3>
<p>1、老旧外设，如果没有厂商配合，在保有量低的情况下，可以引导客户在新系统建设项目过程中，弃用这部分外设，重新采购有厂商支撑的外设
2、如果老旧外设保有量高，可以由项目组开发中间层dll，包装原dll，并实现新标准（c语言开发，不建议该方式）
3、如果行里已有统一标准，并且所有外设都基于统一标准建设，可以在新系统建设过程中引导客户对标准与驱动进行升级。如果实现不行，也可以全部按老标准实现，由项目组对每种外设开发中间层dll</p>
<h3 id="项目建设时推动方式" tabindex="-1"><a class="header-anchor" href="#项目建设时推动方式"><span>项目建设时推动方式</span></a></h3>
<p>先根据外设需求，通过主流外设梳理外设基础功能制定接口标准，厂商基于接口标准实现，进行对接调试，然后逐步推动</p>
</div></template>


