<template><div><p>郑州市场（AB4.0）生产上线第一天多台电脑报出内存不足问题，下面就该问题的出现，分析和解决过程进行详细描述 。</p>
<h4 id="_1-问题描述" tabindex="-1"><a class="header-anchor" href="#_1-问题描述"><span>1： 问题描述</span></a></h4>
<p>首先，郑州市场柜面终端机（实体机）采用 win7（32 位）系统，装载内存（RAM）为 4G，可用内存为 2.68G~3.2G 不等。
（1） 直接报出“关闭程序以防止信息丢失 计算机内存不足。请保存文件并关闭这些程序 adore.exe”等类似错误
<img src="@source/AB产品知识库/images/平台/AB4/市场问题处理案例/郑州市场AB4.0生产上线客户端内存不足案例/1.png" alt="图片描述">
（2） 报出 ads.exe 或者内嵌 exe，“没有足够的内存空间运行此程序，请退出部分程序，然后再试”错误。
<img src="@source/AB产品知识库/images/平台/AB4/市场问题处理案例/郑州市场AB4.0生产上线客户端内存不足案例/2.png" alt="图片描述">
（3） 报错“储存空间不足，无法处理此命令”错误
<img src="@source/AB产品知识库/images/平台/AB4/市场问题处理案例/郑州市场AB4.0生产上线客户端内存不足案例/3.png" alt="图片描述">
（4） 计算机蓝屏
<img src="@source/AB产品知识库/images/平台/AB4/市场问题处理案例/郑州市场AB4.0生产上线客户端内存不足案例/4.png" alt="图片描述"></p>
<h4 id="_2-问题分析" tabindex="-1"><a class="header-anchor" href="#_2-问题分析"><span>2： 问题分析</span></a></h4>
<p>通过远程查看报出内存不足和本地模拟发现，报错内存不足的原因主要为电脑物理内存超过 80%，一般在 85%~90%时报出错误量大大增加：
<img src="@source/AB产品知识库/images/平台/AB4/市场问题处理案例/郑州市场AB4.0生产上线客户端内存不足案例/5.png" alt="图片描述">
（1） 内存占用分析
查看内存占用分析发现，生产上各终端在打开柜面前端（abc）的同时，打开了很多其他高耗内存的软件(如上图), 而整个 abc 占用内存约 350,000~450,000k,其中 adore.exe 占用内存为 239,872K，jcef_helperz 占用内存 63，880k，加上 ads.exe 和一些内嵌的验印和影像 30,000k 左右；同时生产上各终端由于工作需要利用 fireFox 和 chrome 浏览器打开多个与“郑州银行”相关的一些网页和一些行方的其他软件系统，其中 fireFox 和 chrome 浏览器为高耗内存应用，占用内存每个网页占用 100,000k 左右，共可占用内存可高达 300，000~700，000k 不等，导致物理内存超过 90%，报出内存不足错误。
（2） 报错本质原因分析
物理内存是随机储存器（RAM），剩余空间是不连续的，即使你看到 1G 大小的剩余空间，而实际上最大单块空闲内存可能只有 2M 大小，当程序需要创建最大单块空闲内存的对象时，比如一个较大类的对象或加载一个复杂函数，需要超过 2M 内存的时候就一定失败。实际上硬盘和总线内存之类之所以都是 4K，是因为理论上 4k 以内的对象不会创建失败，超过 4K 的对象就可能导致与虚拟内存做页交换。Windows 上“虚拟内存”通常是指 windows 的“页面文件”（pagefile.sys）。配置虚拟内存，可以使操作系统在调度内存时，把大对象或不常用的对象写入页面文件内，防止内存空间不足，报出计算机内存不足错误。</p>
<h4 id="_3、-问题解决" tabindex="-1"><a class="header-anchor" href="#_3、-问题解决"><span>3、 问题解决</span></a></h4>
<p>（1）设置电脑虚拟内存：
计算机——&gt; 高级系统设置——&gt;高级——&gt;设置(性能组)——&gt;高级签页，虚拟内存组，点击更改——&gt;打开虚拟内存弹框，勾选“自动管理所有驱动器的分页大小”——&gt;确定，重启电脑生效。
（2）重启后检查虚拟内存是否生效，行方有些电脑存在电脑自动还原。设 置成功后“自动管理所有驱动器的分页大小”会显示计算机分配的内存大小。
<img src="@source/AB产品知识库/images/平台/AB4/市场问题处理案例/郑州市场AB4.0生产上线客户端内存不足案例/6.png" alt="图片描述">
<img src="@source/AB产品知识库/images/平台/AB4/市场问题处理案例/郑州市场AB4.0生产上线客户端内存不足案例/7.png" alt="图片描述">
<img src="@source/AB产品知识库/images/平台/AB4/市场问题处理案例/郑州市场AB4.0生产上线客户端内存不足案例/8.png" alt="图片描述">
<img src="@source/AB产品知识库/images/平台/AB4/市场问题处理案例/郑州市场AB4.0生产上线客户端内存不足案例/9.png" alt="图片描述"></p>
</div></template>


