<template><div><h1 id="ab5版本管理规范" tabindex="-1"><a class="header-anchor" href="#ab5版本管理规范"><span>AB5版本管理规范</span></a></h1>
<h2 id="背景" tabindex="-1"><a class="header-anchor" href="#背景"><span>背景</span></a></h2>
<p>该文档主要用于指导产品针对解决方案及市场的版本进行管理，规范产品版本发布流程及源码管理流程。</p>
<h2 id="目前面临问题" tabindex="-1"><a class="header-anchor" href="#目前面临问题"><span>目前面临问题</span></a></h2>
<p>1.市场版本与源码不一致问题，源码修改发布后无法与市场版本有效关联；
2.市场版本脱离产品管控范围，市场不使用申请的产品版本，产品版本拼凑后使用；
3.解决方案为保证发版后的快速部署，统一发布全量版本，产品缺少切分支及更新源码的契机；
4.前端组件库以全量方式打包，不支持实时调试，也不支持差量更新，修改市场组件时环境准备较复杂；
5.市场定制化较多，需要切市场分支进行维护。</p>
<h2 id="发版流程" tabindex="-1"><a class="header-anchor" href="#发版流程"><span>发版流程</span></a></h2>
<p><img src="@source/AB产品知识库20240403/images/项目管理/AB5版本管理规范/1.png" alt="版本发布流程.png">
1.产品源码目录下增加版本信息模块，该模块下通过json或者txt文件规范产品版本信息，产品打包正式版本时（脚本或者规范）按照规范将打包时的产品信息记录到相关文件中；
产品版本信息记录：</p>
<p>|产品组 |模块/插件 |版本信息文件名 |
|:--|
|abs |abs-info |PlatformInfo |
|abc |cn.com.agree.ab.a5.client.info |PlatformInfo |
|aui-web |ab-info |PlatformInfo |
|aui-m |ab-info |PlatformInfo |
|sdk |ab-info |PlatformInfo |
| | | |
产品版本信息内容（前端的产品信息中还需要包含npm包列表）：
版本号：AB5.0-TE-ABS/前端/基座  -必要
分支：版本分支名称      --必要
提交节点：git提交的节点id    --必要
打版人：版本打包人    防止暴露个人信息   --可选
打版时间：当前版本打包时间（yyyyMMddHHmmss）  依据这个插件的插件信息   --可选</p>
<p>2.产品每月第一个周一（节假日顺延）发布版本更新到解决方案，更新完成后需要按照解决方案要求根据《 /测试案例/ 》文档测试相关交易，保证相关交易的功能完整性之后版本发布完成，产品发版人需要负责版本的打包、发布及测试工具。柜面、移动、管理端需要同时通知到解决方案相关负责人更新。有问题时需要协调相关人员跟进问题；
发版人员：陈国富、周石勇、徐珂、李春锐、谢平、时金明、谭飞胜、王文虎、颜明民、魏云鹏、陈钧鸿、王裕鸿</p>
<p>3.市场启动时，首次版本以解决方案发布的版本为准，市场提出问题或需求时，问题对接人需要获取版本信息文件，如未切分支需要分支切换之后进行问题跟进，问题处理过程中的测试版本无需更新版本信息，问题处理完成后提交git版本，最后打包正式版本发布给市场，并通知市场以正式版本为准。</p>
</div></template>


